Repository: Amro-yasser/news-app
Catalog: news_app_front/src/locale/messages.*.xlf
Languages: ar

source: Type a word
ar: اكتب كلمة

# arabicPlaceholder
source: Ex. Apple, Netflix, Microsoft
ar: مثال: أبل، نتفليكس، مايكروسوفت

source: Select Language
ar: اختر اللغة

source: Select Theme
ar: اختر الموضوع

source: Search
ar: بحث

source: Empower Your Understanding: Uncover the World's Stories
ar: قم بتمكين فهمك: اكتشف قصص العالم

source: Search for news articles from over 30,000 news sources and blogs
ar: ابحث عن مقالات الأخبار من أكثر من 30،000 مصدر أخبار ومدونات

source: Topic Variety
ar: مواضيع متنوعة

source: Discover the world's stories at your fingertips with our curated news platform.
ar: اكتشف قصص العالم بلمسة واحدة من خلال منصة الأخبار المختارة لدينا.

source: Instant Updates
ar: أحداث فورية

source: Stay informed, stay inspired – where every headline tells a story
ar: ابق على اطلاع، وابق مستوحى - حيث كل عنوان يحكي قصة

source: Personalized Experience
ar: تجربة شخصية

source: Elevate your news experience with personalized updates that matter to you
ar: قم بتعزيز تجربتك في الأخبار مع التحديثات الشخصية التي تهمك

source: {{errorMessage}}<br> Don't worry, you can try searching with different keywords or check back later.
ar: {{errorMessage}}<br> لا تقلق، يمكنك محاولة البحث باستخدام كلمات مفتاحية مختلفة أو التحقق مرة أخرى لاحقًا.

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: business
ar: أعمال

source: entertainment
ar: ترفيه

source: general
ar: عام

source: health
ar: صحة

source: science
ar: علوم

source: sports
ar: رياضة

source: technology
ar: تكنولوجيا
